### Lecture and Lab Session: - Introduction to Pandas Data Frame, Export and Import Files, and Directory Management

#### 1. Import os module

In [14]:
import os

path = '/home/elvin/DEVELOPMENT/liverpool/newlabwork/Week 8 files'

#### 2.1 os.getcwd(): THis command give "Current Working Directory" (CWD) that is running the code

In [15]:
def print_current_working_directory():
    """
    Print the current working directory
    """
    try: 
        cwd = os.getcwd()
        print("Current working directory is: ", cwd)
    except Exception as e:
        print("An error occurred: ", e)

print_current_working_directory()

Current working directory is:  /home/elvin/DEVELOPMENT/liverpool/newlabwork

#### 2.2 os.mkdir(): Create a new directoy

In [16]:
path1 = '/home/elvin/Desktop/new_folder_1'
os.mkdir(path1)

FileExistsError: [Errno 17] File exists: '/home/elvin/Desktop/new_folder_1'

#### 2.3 os.chdir(): CHange directory path
`os.chdir("...")`

#### 3. os.listdir(): Get the full list of all files and directories

In [ ]:
path = '/home/elvin/DEVELOPMENT/liverpool/newlabwork/Week 8 files'
os.listdir(path)

['smalldata.txt', 'store1features.zip', 'plot.png']

#### 4. os.remove(): remove or delete a file path

In [ ]:
def remove_file(file_name, directory):
    """
    Remove a file from a directory
    """
    file_path = os.path.join(directory, file_name)
    try:
       os.remove(file_path)
       print(f"file removed successfully: {file_path}")
    except FileNotFoundError:
        print(f"file not found: {file_path}")
    except PermissionError:
        print(f"Permission denied: {file_path}")
    except Exception as e:
        print(f"An error occurred: {e}")

file_name = "smalldata.txt"
directory = '/home/elvin/DEVELOPMENT/liverpool/newlabwork/Week 8 files'

remove_file(file_name, directory)

file removed successfully: /home/elvin/DEVELOPMENT/liverpool/newlabwork/Week 8 files/smalldata.txt

Check wheteher the removed file exists

In [ ]:
os.path.isfile(directory + file_name)

False

#### 5. List all files of certain type in a directory

In [ ]:

file_types = {
    '.txt': [],
    '.csv': [],
    '.json': [],
    '.xlsx': [],
    '.png': []
}

path = '/home/elvin/DEVELOPMENT/liverpool/newlabwork/Week 8 files'

# serch for files with specific extensions in the directory
for file in os.listdir(path):
    ext = os.path.splitext(file)[1]
    if ext in file_types:
        file_types[ext].append(file)

# print list of files types found in the directory
for ext, files in file_types.items():
    print(f"{ext}: {files}")

.txt: []
.csv: []
.json: []
.xlsx: []
.png: ['plot.png']

### Pandas Library
#### 1. Series
This is a one-dimensional array of indexed data. It can be created from a list of arrays.

In [ ]:
import pandas as pd
data = pd.Series([30, 51.45, 75, 100, 98, 78.50])
data

0     30.00
1     51.45
2     75.00
3    100.00
4     98.00
5     78.50
dtype: float64

In [ ]:
# series to NumPy array
data.values

array([ 30.  ,  51.45,  75.  , 100.  ,  98.  ,  78.5 ])


The index is an array-like object of type pd.Index

In [ ]:
data.index

RangeIndex(start=0, stop=6, step=1)

Data can be accessed by the associated index via the familiar Python square-bracket [] notation:

In [ ]:
data[2]

np.float64(75.0)

In [ ]:
data[2:5]

2     75.0
3    100.0
4     98.0
dtype: float64

Series object has one-dimensional data and index. The index need not be an integer, like Numpy Array has an implicitly defined integer index. For example, Series can have strings as an index:

In [ ]:
data = pd.Series([30, 51.45, 75, 100, 98, 78.50],
                 index=['student1','student2','student3','student4','student5','student6'])
data

student1     30.00
student2     51.45
student3     75.00
student4    100.00
student5     98.00
student6     78.50
dtype: float64

In [ ]:
my_dict = {"y1":23,"y2":78.45,"y3":89,"y4":19}
my_series = pd.Series(my_dict)
my_series

y1    23.00
y2    78.45
y3    89.00
y4    19.00
dtype: float64

#### 2. DataFrame

* 'DataFrame' is a 2-dimensional labeled data structure with columns of different data types.

* Data structure also contains labeled axes (rows and columns). Arithmetic operations align on both row and column labels. It can be thought of as a dictionary like container for Series objects. The primary pandas data structure.

##### 2.1 Create Empty 'DataFrame'

In [ ]:
column_names = ["Company", "Type", "Revenue", "Currency"]
df_empty = pd.DataFrame(columns = column_names)
df_empty

Empty DataFrame
Columns: [Company, Type, Revenue, Currency]
Index: []

##### 2.2 Add rows to empty 'DataFrame'

In [ ]:
#1) Create column names
column_names = ["Company", "Type" ,"Revenue", "Currency"]

#2) Data
data = [
    {"Company": "BCG", "Type": "Consulting", "Revenue": "11.7 billion", "Currency": "USD"},
    {"Company": "Microsoft", "Type": "Tech", "Revenue": "3.114 trillion", "Currency": "USD"},
    {"Company": "Bain & Company", "Type": "Consulting", "Revenue": "8.5 billion", "Currency": "USD"},
    {"Company": "JPMorgan Chase Bank", "Type": "Investment Bank", "Revenue": "705.14 billion", "Currency": "USD"},
    {"Company": "Nvidia", "Type": "Tech", "Revenue": "3.476 trillion", "Currency": "USD"},
    {"Company": "Monzo Bank", "Type": "Digital Bank", "Revenue": "4 billion", "Currency": "GBP"},
    {"Company": "Coinbase", "Type": "Cryptocurrency Exchange", "Revenue": "207 billion", "Currency": "USD"}
]

#3) Create DataFrame
df1 = pd.DataFrame(data, columns=column_names)

#4) print
df1

               Company                     Type         Revenue Currency
0                  BCG               Consulting    11.7 billion      USD
1            Microsoft                     Tech  3.114 trillion      USD
2       Bain & Company               Consulting     8.5 billion      USD
3  JPMorgan Chase Bank          Investment Bank  705.14 billion      USD
4               Nvidia                     Tech  3.476 trillion      USD
5           Monzo Bank             Digital Bank       4 billion      GBP
6             Coinbase  Cryptocurrency Exchange     207 billion      USD

##### 2.3 Append columns to empty `DataFrame`

In [ ]:
#1) Create column names
column_names = ["Company", "Type" ,"Revenue", "Currency"]

#2) Again, Create dataframe with column names defined in previous step
df2 = pd.DataFrame(columns = column_names)

#3) Append columns
df2["Company"] = ['BCG', 'Microsoft', 'Bain & Company', 'JPMorgan Chase Bank', 'Nvidia', 'Monzo Bank', 'Coinbase']
df2["Type"]= ['Consulting', 'Tech', 'Consulting', 'Investment Bank', 'Tech', 'Digital Bank', 'Cryptocurrency Exchange']
df2["Revenue"] = ['11.7 billion', '3.114 trillion', '8.5 billion', '705.14 billion', '3.476 trillion', '4 billion', '207 billion']
df2["Currency"] = ['USD', 'USD', 'USD', 'USD', 'USD', 'GBP', 'USD']

#4) print Dataframe
df2

               Company                     Type         Revenue Currency
0                  BCG               Consulting    11.7 billion      USD
1            Microsoft                     Tech  3.114 trillion      USD
2       Bain & Company               Consulting     8.5 billion      USD
3  JPMorgan Chase Bank          Investment Bank  705.14 billion      USD
4               Nvidia                     Tech  3.476 trillion      USD
5           Monzo Bank             Digital Bank       4 billion      GBP
6             Coinbase  Cryptocurrency Exchange     207 billion      USD

##### 2.4 Data in `Dictionary` to `DataFrame`
Keys of the dict become the DataFrame columns

In [ ]:
test_dictionary = {
    'Company': {0: 'BCG', 1: 'Microsoft', 2: 'Bain & Company', 3: 'JPMorgan Chase Bank', 4: 'Nvidia', 5: 'Monzo Bank', 6: 'Coinbase'},
    'Revenue': {0: '11.7 billion', 1: '3.114 trillion', 2: '8.5 billion', 3: '705.14 billion', 4: '3.476 trillion', 5: '4 billion', 6: '207 billion'},
    'Currency': {0: 'USD', 1: 'USD', 2: 'USD', 3: 'USD', 4: 'USD', 5: 'GBP', 6: 'USD'}
}

dict_to_df = pd.DataFrame.from_dict(test_dictionary)
print(dict_to_df)

               Company         Revenue Currency
0                  BCG    11.7 billion      USD
1            Microsoft  3.114 trillion      USD
2       Bain & Company     8.5 billion      USD
3  JPMorgan Chase Bank  705.14 billion      USD
4               Nvidia  3.476 trillion      USD
5           Monzo Bank       4 billion      GBP
6             Coinbase     207 billion      USD

##### 2.5 NumPy array to Pandas DataFrame

In [ ]:
import numpy as np

# 2) Store data in NumPy array (you can convert list of list in other words, 2D list to NumPy array)
numpy_data = np.array([
    ['BCG', 'Consulting', '11.7 billion', 'USD'],
    ['Microsoft', 'Tech', '3.114 trillion', 'USD'],
    ['Bain & Company', 'Consulting', '8.5 billion', 'USD'],
    ['JPMorgan Chase Bank', 'Investment Bank', '705.14 billion', 'USD'],
    ['Nvidia', 'Tech', '3.476 trillion', 'USD'],
    ['Monzo Bank', 'Digital Bank', '4 billion', 'GBP'],
    ['Coinbase', 'Cryptocurrency Exchange', '207 billion', 'USD']
])

# 3) NumPy array to Pandas DataFrame
df4 = pd.DataFrame(data=numpy_data, columns=["Company", "Type", "Revenue", "Currency"])

# 4) Display the DataFrame
df4

               Company                     Type         Revenue Currency
0                  BCG               Consulting    11.7 billion      USD
1            Microsoft                     Tech  3.114 trillion      USD
2       Bain & Company               Consulting     8.5 billion      USD
3  JPMorgan Chase Bank          Investment Bank  705.14 billion      USD
4               Nvidia                     Tech  3.476 trillion      USD
5           Monzo Bank             Digital Bank       4 billion      GBP
6             Coinbase  Cryptocurrency Exchange     207 billion      USD

##### 2.6 Index of a `DataFrame` to a `list`

In [ ]:
list(df1.index)

[0, 1, 2, 3, 4, 5, 6]

##### 2.7 Column names od a `DataFrame` to a `list`

In [ ]:
list(df1.columns)

['Company', 'Type', 'Revenue', 'Currency']

##### 2.8 Set New Index: Set one of column of DataFrame as Index

In [ ]:
df1 = df1.set_index('Company')
df1

                                        Type         Revenue Currency
Company
BCG                               Consulting    11.7 billion      USD
Microsoft                               Tech  3.114 trillion      USD
Bain & Company                    Consulting     8.5 billion      USD
JPMorgan Chase Bank          Investment Bank  705.14 billion      USD
Nvidia                                  Tech  3.476 trillion      USD
Monzo Bank                      Digital Bank       4 billion      GBP
Coinbase             Cryptocurrency Exchange     207 billion      USD

##### 2.9 Reset index of DataFrame

In [ ]:
df1.reset_index(inplace=True)
df1

               Company                     Type         Revenue Currency
0                  BCG               Consulting    11.7 billion      USD
1            Microsoft                     Tech  3.114 trillion      USD
2       Bain & Company               Consulting     8.5 billion      USD
3  JPMorgan Chase Bank          Investment Bank  705.14 billion      USD
4               Nvidia                     Tech  3.476 trillion      USD
5           Monzo Bank             Digital Bank       4 billion      GBP
6             Coinbase  Cryptocurrency Exchange     207 billion      USD

##### 2.10 Get the first n rows  of DataFrame
`DataFrame.head(n=3)`

n = 5 is default value. Following statment will return first five rows. DataFrame.head()

In [ ]:
df1.head(3)

          Company        Type         Revenue Currency
0             BCG  Consulting    11.7 billion      USD
1       Microsoft        Tech  3.114 trillion      USD
2  Bain & Company  Consulting     8.5 billion      USD

##### 2.11 Get the last n rows of DataFrame
`DataFrame.tail(n=2)`

n = 5 is default value. Following statment will return last five rows.

In [ ]:
df1.tail(2)

      Company                     Type      Revenue Currency
5  Monzo Bank             Digital Bank    4 billion      GBP
6    Coinbase  Cryptocurrency Exchange  207 billion      USD

#### 3. Import Data into Python

* .csv: Comma-separated files (text-based)
* .xlsx: Excel file (spread sheet)
* .json: JavaScript object notation file (text-based)
* url: Read data from a webpage

Use Pandas library to import data.

##### 3.1 Import Pandas library and Set Directory or Folder path where data files are saved in your computer

In [17]:
print("hello")

hello